MATCH_TYPE = {
    30: '리그 친선',
    40: '클래식 1on1',
    50: '공식경기',
    52: '감독모드',
    60: '공식 친선',
    204: '볼타 친선',
    214: '볼타 공식',
    224: '볼타 AI대전',
    234: '볼타 커스텀',
}

DIVISION = {
    800: '슈퍼챔피언스',
    900: '챔피언스',
    1000: '슈퍼챌린지',
    1100: '챌린지1',
    1200: '챌린지2',
    1300: '챌린지3',
    2000: '월드클래스1',
    2100: '월드클래스2',
    2200: '월드클래스3',
    2300: '프로1',
    2400: '프로2',
    2500: '프로3',
    2600: '세미프로1',
    2700: '세미프로2',
    2800: '세미프로3',
    2900: '유망주1',
    3000: '유망주2',
    3100: '유망주3'
}

const POSITION = {
    0: 'GK',
    1: 'SW',
    2: 'RWB',
    3: 'RB',
    4: 'RCB',
    5: 'CB',
    6: 'LCB',
    7: 'LB',
    8: 'LWB',
    9: 'RDM',
    10: 'CDM',
    11: 'LDM',
    12: 'RM',
    13: 'RCM',
    14: 'CM',
    15: 'LCM',
    16: 'LM',
    17: 'RAM',
    18: 'CAM',
    19: 'LAM',
    20: 'RF',
    21: 'CF',
    22: 'LF',
    23: 'RW',
    24: 'RS',
    25: 'ST',
    26: 'LS',
    27: 'LW',
    28: 'SUB',
  };


module.exports = {
    MATCH_TYPE,
    DIVISION,
    POSITION
} 