MATCH_TYPE = {
    30: '리그 친선',
    40: '클래식 1on1',
    50: '공식경기',
    52: '감독모드',
    60: '공식 친선',
    204: '볼타 친선',
    214: '볼타 공식',
    224: '볼타 AI대전',
    234: '볼타 커스텀',
}

DIVISION = {
    800: '슈퍼챔피언스',
    900: '챔피언스',
    1000: '슈퍼챌린지',
    1100: '챌린지1',
    1200: '챌린지2',
    1300: '챌린지3',
    2000: '월드클래스1',
    2100: '월드클래스2',
    2200: '월드클래스3',
    2300: '프로1',
    2400: '프로2',
    2500: '프로3',
    2600: '세미프로1',
    2700: '세미프로2',
    2800: '세미프로3',
    2900: '유망주1',
    3000: '유망주2',
    3100: '유망주3'
}


module.exports = {
    MATCH_TYPE,
    DIVISION
} 